Tekla Open API Reference for Tekla Structures 2025
Events.ModelLoadInfoDelegate Delegate
 The delegate to use for extended model load.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ModelLoadInfoDelegate(
	string ModelLoadInfo
)
Public Delegate Sub ModelLoadInfoDelegate (
	ModelLoadInfo As String
)
Parameters
ModelLoadInfo
Type: System.String
See Also
Reference
Tekla.Structures.Model Namespace